
* DONE Write an answer for this question
  CLOSED: [2018-06-21 Thu 00:26]
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-02-18 Mon 00:51
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:

  [[https://emacs.stackexchange.com/a/42139/11507][How to use an external program as the default way to open PDFs from Emacs?]]



* DONE [#A] Define mu4e contexts
  CLOSED: [2018-05-20 Sun 00:46]
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-02-19 Tue 21:28
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_OLPATH: Improve Emacs configuration
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:

The context system is the built-in way to handle multiple account in
mu4e.



* DONE Refine mu4e contexts
  CLOSED: [2018-06-01 Fri 15:27]
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-02-19 Tue 21:28
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_OLPATH: Improve Emacs configuration
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:

Reply or forward action should automatically detect the contexts
instead of relying on manual context switching.



* DONE suppress region mark in Emacs when CapsLock is on
  CLOSED: [2018-05-28 Tue 00:05]
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-02-19 Tue 21:28
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_OLPATH: Improve Emacs configuration
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:

  I believe this was achieved by disabling ~shift-select-mode~.



* DONE Conditional eval view-mode for directory local variables
  CLOSED: [2018-05-30 Wed 13:49]
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-02-19 Tue 21:28
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_OLPATH: Improve Emacs configuration
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:

Refer to this [[https://emacs.stackexchange.com/q/825/11507][SE]] site on how to check if buffer has an associated
file.


* DONE Create missing parent directories for the opened file
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-02-22 Fri 13:29
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_OLPATH: Improve Emacs configuration
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:

  See https://emacs.stackexchange.com/a/47982/11507



* DONE Setup MobileOrg
  CLOSED: [2019-10-22 Tue 17:49]
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-10-23 Wed 18:59
  :ARCHIVE_FILE: ~/Org/lfj.org
  :ARCHIVE_CATEGORY: lfj
  :ARCHIVE_TODO: DONE
  :END:
  :LOGBOOK:
  CLOCK: [2019-10-22 Tue 16:19]--[2019-10-22 Tue 17:49] =>  1:30
  :END:

  This is not the way how things should be done.  It doesn't support
  tracking time.  What a waste of time setting all this up!


* Safe local variables

Find a better way to organize safe local variables configuration.
Putting them all in the Customize interface is ugly especially when
the same variable has more than one safe values.


* Discuss Emacs bugs on mailing list


** Defect in =smtplib= related to authentication


** Bug in =dired-x= related to ~dired-bind-jump~

When ~dired-bind-jump~ is set to nil, it shouldn't set =C-x C-j= and
=C-x 4 C-j= and should leave them untouched.


* Try out lsp-mode

  * [[https://github.com/emacs-lsp/lsp-mode#supported-languages][lsp-mode Supported languages]]
  * [[https://github.com/emacs-lsp/lsp-java#installation][lsp-java Installation]]


* Update org-open-file behavior

  * [[https://emacs.stackexchange.com/q/22736/11507][Org-mode: How to disable automatic doc-view on emacs-25]]
  * [[http://rachid.koucha.free.fr/tech_corner/pty_pdip.html][Using pseudo-terminals (pty) to control interactive programs]]


* ENSIME

  ENSIME is dead and no need to report now.


** DONE Report ENSIME implicit dependency
   CLOSED: [2019-10-27 Sun 18:11]
   :PROPERTIES:
   :ARCHIVE_TIME: 2019-10-27 Sun 18:10
   :ARCHIVE_FILE: ~/Org/lfj.org
   :ARCHIVE_CATEGORY: lfj
   :ARCHIVE_TODO: TODO
   :END:

 ENSIME depends on package ~expand-region~.


** ENSIME refactor infinitely applying hunk bug

   See https://github.com/ensime/ensime-emacs/pull/702


** DONE [#A] Create an PR for ensime-sbt
   CLOSED: [2019-11-07 Thu 22:56]

   Java 11 now ships ~src.zip~ under ~lib~ as ~lib/src.zip~ and
   =ensime-sbt= cannot find it.

   Under Ubuntu, this also caused a problem. The file ~src.zip~ was
   linked to ~../openjdk-11/src.zip~ but should be
   ~../openjdk-11/lib/src.zip~ instead.



* Rewrite key sequences using kbd
  :LOGBOOK:
  CLOCK: [2020-05-19 Tue 17:34]--[2020-05-19 Tue 17:45] =>  0:11
  :END:


* Smart find-alternate-file
  :LOGBOOK:
  CLOCK: [2020-05-19 Tue 17:53]--[2020-05-19 Tue 19:20] =>  1:27
  :END:


* CEDET/Semantic/lsp-mode/Xref

  [[http://ergoemacs.org/misc/elisp_sucks_donkey_ass.html][Language Server Protocol Kills Emacs]]
